# ==========================================================================================
# 5 kyu Almost Isosceles Integer Triangles With Their Angles With Asymptotic Tendency
# https://www.codewars.com/kata/5be4d000825f24623a0001e8/train/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu Binary relation optimization
# https://www.codewars.com/kata/603928e6277a4e002bb33d5a/train/ruby
# ==========================================================================================
# Нужно переделывать. Проблемы с тестами


# ==========================================================================================
# 5 kyu What Would They Have in Common?
# https://www.codewars.com/kata/58e8561f06db4d4cc600008c/train/ruby
# ==========================================================================================
# Нужно переделывать. Другие решения намного быстрее


# ==========================================================================================
# 5 kyu Simple Fun #128: Doubly Not Less
# https://www.codewars.com/kata/58a3ea0a8bdda5093800000e/solutions/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu Fix arithmetic progression
# https://www.codewars.com/kata/5b77b030f0aa5c9114000024/solutions
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu Wimbledon Scoreboard - Game
# https://www.codewars.com/kata/5b4bccfabeb865730d000062/train/ruby
# ==========================================================================================
# Нужно переделывать. Есть ошибка


# ==========================================================================================
# 5 kyu Cryptic Cave: Episode 1
# https://www.codewars.com/kata/5a5c5a1ab3bfa8728d00008d/solutions
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu MONTE CARLO 3D
# https://www.codewars.com/kata/55f9ee4d8f3bbabf2200000c/train/ruby
# ==========================================================================================
# Нужно переделывать. Есть ошибка


# ==========================================================================================
# 5 kyu Trip Checker
# https://www.codewars.com/kata/52ee76fdf5f13567000005ae/train/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu Getting along with Bernoulli's numbers
# https://www.codewars.com/kata/5a02cf76c9fc0ee71d0000d5/train/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 kyu Simple Fun #188: Slogans
# https://www.codewars.com/kata/58bf79fdc8bd4432d6000029/train/ruby
# ==========================================================================================
# Нужно переделывать. Есть ошибки, не проходит некоторые тесты.


# ==========================================================================================
# 5 Minimum unfairness of a list/array
# https://www.codewars.com/kata/577bcb5dd48e5180030004de/train/ruby
# ==========================================================================================
# Нужно переделывать. Слишком медленно.


# ==========================================================================================
# 5 Simple Fun #53: Combs
# https://www.codewars.com/kata/58898b50b832f8046a0000ec/train/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 Adding words - Part II
# https://www.codewars.com/kata/592eccf7d6a5403edf000aa1/train/ruby
# ==========================================================================================
# Нужно переделывать.


# ==========================================================================================
# 5 Simple Fun #299: Look And Say And Sum
# https://www.codewars.com/kata/5922828c80a27c049c000078/train/ruby
# ==========================================================================================
# Нужно переделывать(медленнее топ решения в 2 раза).


# ==========================================================================================
# 5 Palindrome integer composition
# https://www.codewars.com/kata/599b1a4a3c5292b4cc0000d5/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод).


# ==========================================================================================
# 5 Sorting Arrays by the Amount of Perfect Squares that Each Element May Generate
# https://www.codewars.com/kata/582fdcc039f654905400001e/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Max Collatz Sequence Length
# https://www.codewars.com/kata/53a9ee602f150d5d6b000307/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Prime Sextuplets
# https://www.codewars.com/kata/57bf7fae3b3164dcac000352/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Custom attr_accessor
# https://www.codewars.com/kata/53a8a236a9198e218d000195/train/ruby
# ==========================================================================================
# Нужно переделывать(разобрать как работает).


# ==========================================================================================
# 5 Hungry Hippos
# https://www.codewars.com/kata/590300eb378a9282ba000095/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Range of Integers in an Unsorted String
# https://www.codewars.com/kata/5b6b67a5ecd0979e5b00000e/train/ruby
# ==========================================================================================
# Нужно переделывать(не проходит некоторые тесты).


# ==========================================================================================
# 5 Integer to English
# https://www.codewars.com/kata/53c94a82689f84c2dd00007d/train/ruby
# ==========================================================================================
# Нужно переделывать(Хардкод).


# ==========================================================================================
# 5 Bob's reversing obfuscator
# https://www.codewars.com/kata/559ee79ab98119dd0100001d/train/ruby
# ==========================================================================================
# Нужно переделывать(не проходит некоторые тесты).


# ==========================================================================================
# 5 String -> N iterations -> String
# https://www.codewars.com/kata/5ae43ed6252e666a6b0000a4/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Iterative Rotation Cipher
# https://www.codewars.com/kata/5a3357ae8058425bde002674/train/ruby
# ==========================================================================================
# Нужно переделывать(один тест хардкод).


# ==========================================================================================
# 5 Missing number in Unordered Arithmetic Progression
# https://www.codewars.com/kata/568fca718404ad457c000033/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Ninety Nine Thousand Nine Hundred Ninety Nine
# https://www.codewars.com/kata/5463c8db865001c1710003b2/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 Simple CSS selector comparison
# https://www.codewars.com/kata/5379fdfad08fab63c6000a63/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно).


# ==========================================================================================
# 5 RoboScript #2 - Implement the RS1 Specification
# https://www.codewars.com/kata/5870fa11aa0428da750000da/train/ruby
# ==========================================================================================
# Нужно переделывать(иногда ошибка).


# ==========================================================================================
# 5 Morse Encoding
# https://www.codewars.com/kata/536602df5d0266e7b0000d31/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки).


# ==========================================================================================
# 5 ASCII85 Encoding & Decoding
# https://www.codewars.com/kata/5277dc3ff4bfbd9a36000c1c/train/ruby
# ==========================================================================================
# Нужно переделывать


# ==========================================================================================
# 5 Numbers that are a power of their sum of digits
# https://www.codewars.com/kata/55f4e56315a375c1ed000159/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод)


# ==========================================================================================
# 5 Metric Units - 1
# https://www.codewars.com/kata/5264f5685fda8ed370000265/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки).


# ==========================================================================================
# 5 Some Egyptian fractions
# https://www.codewars.com/kata/54f8693ea58bce689100065f/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод).


# ==========================================================================================
# 5 Some Did you mean ...?
# https://www.codewars.com/kata/5259510fc76e59579e0009d4/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод).
