# ==========================================================================================
# 3 kyu Rail Fence Cipher: Encoding and Decoding   https://www.codewars.com/kata/58c5577d61aefcf3ff000081/train/ruby
# ==========================================================================================
# переделать. В решении какието ошибки через раз не проходит много тестов


# ==========================================================================================
# 3 kyu Binomial Expansion   https://www.codewars.com/kata/540d0fdd3b6532e5c3000b5b/train/ruby
# ==========================================================================================
# переделать
