# ==========================================================================================
# 6 kyu No Modulo Mk II
# https://www.codewars.com/kata/54fd8340b58689c43e001061/train/ruby
# ==========================================================================================
# Нужно переделывать(решить без читов)

# ==========================================================================================
# 6 kyu Find the Biggest Triangle
# https://www.codewars.com/kata/55f0a7d8c44c6f1438000013/train/ruby
# ==========================================================================================
# Нужно переделывать(иногда тест выдает ошибку)

# ==========================================================================================
# 6 kyu Square Cubic Triples
# https://www.codewars.com/kata/5618716a738b95cee8000062/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #56: Beautiful Text
# https://www.codewars.com/kata/58899b0c97630e0b70000089/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Digit-by-digit number
# https://www.codewars.com/kata/533ee21f69fcbb36110001d5/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Custom Christmas Tree III: the center of leaves
# https://www.codewars.com/kata/5a4076f3e1ce0ee6d4000010/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Next level string padding
# https://www.codewars.com/kata/56f3ca069821793533000a3a/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки в тестах)
