# ==========================================================================================
# 6 kyu No Modulo Mk II
# https://www.codewars.com/kata/54fd8340b58689c43e001061/train/ruby
# ==========================================================================================
# Нужно переделывать(решить без читов)

# ==========================================================================================
# 6 kyu Find the Biggest Triangle
# https://www.codewars.com/kata/55f0a7d8c44c6f1438000013/train/ruby
# ==========================================================================================
# Нужно переделывать(иногда тест выдает ошибку)

# ==========================================================================================
# 6 kyu Square Cubic Triples
# https://www.codewars.com/kata/5618716a738b95cee8000062/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #56: Beautiful Text
# https://www.codewars.com/kata/58899b0c97630e0b70000089/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Digit-by-digit number
# https://www.codewars.com/kata/533ee21f69fcbb36110001d5/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Custom Christmas Tree III: the center of leaves
# https://www.codewars.com/kata/5a4076f3e1ce0ee6d4000010/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Next level string padding
# https://www.codewars.com/kata/56f3ca069821793533000a3a/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки в тестах)

# ==========================================================================================
# 6 kyu Sorting Time
# https://www.codewars.com/kata/57024825005264fe9200057d/train/ruby
# ==========================================================================================
# Нужно переделывать(редко ошибки в тестах)

# ==========================================================================================
# 6 kyu Non Decomposable Primes as Sums of Perfect Squares
# https://www.codewars.com/kata/561c34b31dbb1b11640000de/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки в тестах)

# ==========================================================================================
# 6 kyu Simple Fun #323: Bears And Apples
# https://www.codewars.com/kata/594cc999d3cc8c883a00003b/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод)

# ==========================================================================================
# 6 kyu Climbing the Leaderboard
# https://www.codewars.com/kata/5b19f34c7664aacf020000ec/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно не проходит тесты часто)

# ==========================================================================================
# 6 kyu Simple Fun #342: Buy Newspaper
# https://www.codewars.com/kata/596c26187bd547f3a6000050/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Simple Fun #192: Three Details
# https://www.codewars.com/kata/58c212c6f130b7c4660000a5/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Progressive Spiral Number Distance
# https://www.codewars.com/kata/5a27e3438882f334a10000e3/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #130: Robot Walk
# https://www.codewars.com/kata/58a64b48586e9828df000109/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)
