# ==========================================================================================
# 6 kyu No Modulo Mk II
# https://www.codewars.com/kata/54fd8340b58689c43e001061/train/ruby
# ==========================================================================================
# Нужно переделывать(решить без читов)

# ==========================================================================================
# 6 kyu Find the Biggest Triangle
# https://www.codewars.com/kata/55f0a7d8c44c6f1438000013/train/ruby
# ==========================================================================================
# Нужно переделывать(иногда тест выдает ошибку)

# ==========================================================================================
# 6 kyu Square Cubic Triples
# https://www.codewars.com/kata/5618716a738b95cee8000062/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #56: Beautiful Text
# https://www.codewars.com/kata/58899b0c97630e0b70000089/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Digit-by-digit number
# https://www.codewars.com/kata/533ee21f69fcbb36110001d5/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибка в тестах)

# ==========================================================================================
# 6 kyu Custom Christmas Tree III: the center of leaves
# https://www.codewars.com/kata/5a4076f3e1ce0ee6d4000010/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Next level string padding
# https://www.codewars.com/kata/56f3ca069821793533000a3a/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки в тестах)

# ==========================================================================================
# 6 kyu Sorting Time
# https://www.codewars.com/kata/57024825005264fe9200057d/train/ruby
# ==========================================================================================
# Нужно переделывать(редко ошибки в тестах)

# ==========================================================================================
# 6 kyu Non Decomposable Primes as Sums of Perfect Squares
# https://www.codewars.com/kata/561c34b31dbb1b11640000de/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки в тестах)

# ==========================================================================================
# 6 kyu Simple Fun #323: Bears And Apples
# https://www.codewars.com/kata/594cc999d3cc8c883a00003b/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод)

# ==========================================================================================
# 6 kyu Climbing the Leaderboard
# https://www.codewars.com/kata/5b19f34c7664aacf020000ec/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно не проходит тесты часто)

# ==========================================================================================
# 6 kyu Simple Fun #342: Buy Newspaper
# https://www.codewars.com/kata/596c26187bd547f3a6000050/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Simple Fun #192: Three Details
# https://www.codewars.com/kata/58c212c6f130b7c4660000a5/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Progressive Spiral Number Distance
# https://www.codewars.com/kata/5a27e3438882f334a10000e3/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #130: Robot Walk
# https://www.codewars.com/kata/58a64b48586e9828df000109/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)

# ==========================================================================================
# 6 kyu Codwars or Codewars?
# https://www.codewars.com/kata/5967a67c8b0fc0093e000062/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)

# ==========================================================================================
# 6 kyu LCM Cardinality
# https://www.codewars.com/kata/5c45bef3b6adcb0001d3cc5f/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)

# ==========================================================================================
# 6 kyu D&D Character generator #1: attribute modifiers and spells
# https://www.codewars.com/kata/596a690510ffee5c0b00006a/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu n-th reversible prime
# https://www.codewars.com/kata/5826c14622be6ef2a4000033/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Lucky Sevens
# https://www.codewars.com/kata/58275b63083e128edb00098d/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu T9 Predictor
# https://www.codewars.com/kata/5b085335abe956c1ef000266/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Minimum Reduction
# https://www.codewars.com/kata/5ba47374b18e382069000052/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Elections: Weighted Average
# https://www.codewars.com/kata/5827d31b86f3b0d9390001d4/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Ulam Sequences
# https://www.codewars.com/kata/5995ff073acba5fa3a00011d/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Find a Bunch of Common Elements of Two Lists in a Certain Range
# https://www.codewars.com/kata/58161c5ac7e37d17fc00002f/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Unique Substring From Joined Strings
# https://www.codewars.com/kata/5778aa7c82d7d0b49c00001a/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Total Primes
# https://www.codewars.com/kata/5a516c2efd56cbd7a8000058/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Scooby Doo Puzzle
# https://www.codewars.com/kata/58693bbfd7da144164000d05/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu String subpattern recognition III
# https://www.codewars.com/kata/5a4a2973d8e14586c700000a/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Simple Fun #290: Sum Of Threes
# https://www.codewars.com/kata/591d3375e51f4a0940000052/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Shop Inventory Manager
# https://www.codewars.com/kata/55d1d06def244b18c100007c/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Simple Fun #64: Almost Increasing Sequence
# https://www.codewars.com/kata/5893e7578afa367a61000036/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)

# ==========================================================================================
# 6 kyu Stone bridge primes
# https://www.codewars.com/kata/5a1502db46d84395ab00008a/train/ruby
# ==========================================================================================
# Нужно переделывать(хардкод)

# ==========================================================================================
# 6 kyu Permutations Of An Array And Associated Values
# https://www.codewars.com/kata/562c5ea7b5fe27d303000054/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Find a Very Special Set Of Numbers In a Certain Range
# https://www.codewars.com/kata/569df0bc5565b243d500002b/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно)

# ==========================================================================================
# 6 kyu Hexagon Beam Max Sum
# https://www.codewars.com/kata/5ecc1d68c6029000017d8aaf/train/ruby
# ==========================================================================================
# Нужно переделывать(слишком большое решение)

# ==========================================================================================
# 6 kyu Simple Fun #122: String Constructing
# https://www.codewars.com/kata/58a3a735cebc0630830000c0/train/ruby
# ==========================================================================================
# Нужно переделывать(медленно + слишком большое решение)

# ==========================================================================================
# 6 kyu Change your Points of View
# https://www.codewars.com/kata/5ca3ae9bb7de3a0025c5c740/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)

# ==========================================================================================
# 6 kyu Largest Value of a Power Less Than a Number
# https://www.codewars.com/kata/5e860c16c7826f002dc60ebb/train/ruby
# ==========================================================================================
# Нужно переделывать(ошибки)
